app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO `employees` (`age`, `contact_no`, `created_at`, `email`, `gender`, `name`, `updated_at`) VALUES (30, '1111111111', '2023-02-08 00:03:39', 'test@test.com', 'Male', 'Prashant', '2023-02-08 00:03:39')

  def bulk_upload
    file = params[:file]
    @success = []
    @errors = []
    file_ext = File.extname(file.original_filename)
    if (file_ext == (".xls" || ".xlsx"))
      spreadsheet = (file_ext == ".xls") ? Roo::Excel.new(file.path, file_warning: :ignore) : Roo::Excelx.new(file.path, file_warning: :ignore)
      header = spreadsheet.row(1)
      (2..spreadsheet.last_row).each do |i|
        begin
          binding.pry
          name = spreadsheet.row(i)[0]
          gender = spreadsheet.row(i)[1]
          email = spreadsheet.row(i)[2]
          age = spreadsheet.row(i)[3].to_i
          contact = spreadsheet.row(i)[4].to_i
          company_id = Company.where("company_name LIKE ?", "%#{spreadsheet.row(i)[5]}%").first.id rescue nil
          employee = {:name=>name, :gender=>gender, :email=>email, :age=>age, :contact_no=>contact.to_s, :company_id=> company_id}
          employee_imported = Employee.new(employee)
          if employee_imported.save
---
SELECT  `companies`.* FROM `companies`  WHERE (company_name LIKE '%something%')  ORDER BY `companies`.`id` ASC LIMIT 1
INSERT INTO `employees` (`age`, `company_id`, `contact_no`, `created_at`, `email`, `gender`, `name`, `updated_at`) VALUES (30, 1, '8976360364', '2023-02-08 04:11:59', 'test1@test.com', 'Male', 'Prash', '2023-02-08 04:11:59')

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT  `employees`.* FROM `employees`  WHERE `employees`.`id` = 1 LIMIT 1